Tekla Open API Reference for Tekla Structures 2025
CustomObservableCollection<T> Class
 CustomObservableCollection for synchronizing UI controls.
Inheritance Hierarchy
System.Object
 System.Collections.ObjectModel.Collection<T>
 System.Collections.ObjectModel.ObservableCollection<T>
 Tekla.Structures.Dialog.UIControls.CustomObservableCollection<T>
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class CustomObservableCollection<T> : ObservableCollection<T>
Public Class CustomObservableCollection(Of T)
	Inherits ObservableCollection(Of T)
Type Parameters
T
The CustomObservableCollection<T> type exposes the following members.
Constructors
Name | Description
CustomObservableCollection<T>()
 CustomObservableCollection constructor.
CustomObservableCollection<T>(IEnumerable<T>)
 CustomObservableCollection constructor.
CustomObservableCollection<T>(List<T>)
 CustomObservableCollection constructor.
Top
Methods
Name | Description
Repopulate
 CustomObservableCollection repopulator, sends notification about property and collection change.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace